-- RTS TYPE='K' (선물 체결).

local mas = _G.mas or {}
_G.mas = mas
mas.rts_defs = mas.rts_defs or {}

mas.rts_defs[#mas.rts_defs + 1] = {
  type = "K", euckr = true,
  fields = {
    { "034", "체결시간" }, { "023", "현재가" }, { "024", "전일대비" }, { "033", "등락율" },
    { "025", "매도호가" }, { "026", "매수호가" }, { "032", "체결량" }, { "027", "거래량" },
    { "028", "거래대금" }, { "029", "시가" }, { "030", "고가" }, { "031", "저가" },
    { "201", "미결약정" }, { "202", "이론가" }, { "203", "이론BASIS" }, { "204", "시장BASIS" },
    { "205", "괴리율" }, { "206", "미결대비" }, { "207", "괴리치" }, { "037", "도-체결량" },
    { "038", "수-체결량" }, { "388", "3분체결강도" }, { "193", "도-체결합" },
    { "194", "수-체결합" }, { "387", "체결강도" }, { "448", "미결증감" }, { "249", "전일거래량비" },
    { "462", "KP200" }, { "200", "선물최근현재" }, { "358", "이론대비" }, { "411", "실시간상한가" },
    { "412", "실시간하한가" }, { "414", "협의대량누적체결량" }, { "415", "상한가단계폭" },
    { "416", "하한가단계폭" },
  },
}
